[{"title":"我胡汉三又回来啦（误","date":"2016-09-18T22:37:12.000Z","path":"2016/09/18/comeback/","text":"嗯，之前因为种种原因没法更新博客，现在我又回来啦qwq（当然我不是胡汉三 上个月初到的美帝，然而没带电脑 Orz刚来的几天里连手机都没有。 后来在 Amazon 上定了一部 Nexus 5X磨叽的 Amazon 把手机送过来花了将近十天也是可怕 Orz 到了以后才发现 Google Store 上买更便宜而且送货更快 Orz（我运营商选的是 Google Project Fi，如果在官方商城买会有优惠） 只有部手机拿来写博客还是比较麻烦的（毕竟我用的是 Hexo 其实还去买了个耳机，然而那个线……过敏到现在还没完全好 之后又去渣想官网买了新的笔记本（真是美帝良心不过他们的订单系统也是蛮神奇的。 8月28日 下单 8月29日 说 9月12日 发货 8月30日 订单被冻结，说扣款出现问题 8月31日 联系客服，解决了上面的问题，重新变为 9月12日 发货 9月01日-09日 OVP 上显示为 9月23日 发货（噫 9月10日 变为 9月12日 发货 9月11日 变为 9月13日 发货 9月12日 依旧是 9月13日 发货 9月13日 突然跟我说 9月9日 已经发货了，都已经从香港到美帝了 9月14日 中转中（ 9月15日 到货 我只能说我大概是穿越了世界线又有 READING;STEINER 能力吧 机器倒是蛮不错的 qwq以后有空水写一篇博文来讲讲。","tags":[{"name":"blog","slug":"blog","permalink":"https://v2bv.win/tags/blog/"},{"name":"water","slug":"water","permalink":"https://v2bv.win/tags/water/"}]},{"title":"重建了一下博客","date":"2016-07-18T09:45:04.000Z","path":"2016/07/18/rebuilt-blog/","text":"额…似乎有段时间没写博客了。 之前被我弄丢了 Hexo 的配置文件（扔 Gentoo 的 /home 里了，没备份然后被我格了）（没错我把 Gentoo 格了，我这渣本上跑 Gentoo 还是有些难以忍受），然后又没钱去租 VPS 搭建动态博客（或者就算搭了效果也不见得会比用 Hexo+GitHub Pages+CloudFlare 效果好） 然后就重新建了个博客，依旧用的原来的搭配，不过换了个主题（换成了 yscoder 做的 indigo ）（Material Design 什么的最好了），略做了些修改。 新的配置+文章源文件（.md 文档）放在这里。（图省事把 node_modules 也扔进去了）（逃 然后在配置时也撞了几个坑，不过至少能用了2333333 #TODO Links：当然是友链啦~（虽然我觉得没有多少人会愿意跟我加友链qwqDONE (Link) 关于页面：既然是个博客啦，怎么能少了关于页面 ~DONE (Link) 各种细小的修改：这个就有些多啦，不一一细说了~ 以上","tags":[{"name":"Blog","slug":"Blog","permalink":"https://v2bv.win/tags/Blog/"}]},{"title":"Hello World","date":"2016-07-18T02:30:47.000Z","path":"2016/07/17/hello-world/","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","tags":[]}]